Autodesk.Revit.DB.LinePatternElement.GetLinePatternElementByName(Autodesk.Revit.DB.Document,System.String)
Retrieves the LinePatternElement by its name.
document:
The document in which to retrieve the LinePatternElement.
name:
The name of the LinePatternElement.
Returns:
The LinePatternElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.LinePatternElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinePattern)
Creates a new LinePatternElement.
document:
The document in which to create the LinePatternElement.
linePattern:
The LinePattern associated to the newly created LinePatternElement.
Returns:
The newly created LinePatternElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Line Pattern is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.LinePatternElement.SetLinePattern(Autodesk.Revit.DB.LinePattern)
Sets the LinePattern associated to this element.
Remarks:
The data stored inside the input LinePattern will be copied into this element.
The input LinePattern itself will not be associated with the element.
newLinePattern:
The new LinePattern object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Line Pattern is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.LinePatternElement.GetLinePattern(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the LinePattern associated to an element or from a built-in line pattern.
document:
The document in which to retrieve the LinePattern.
elementId:
The ElementId of the LinePatternElement or the built-in line pattern id.
Returns:
A copy of LinePattern object. null if the ElementId doesn't represent a line pattern element
or built-in line pattern. null for Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.LinePatternElement.GetSolidPatternId
Gets the solid line pattern element id.
Remarks:
Note that Solid is special. It isn't a line pattern at all -- it is a special code that tells drawing
and export code to use solid lines rather than patterned lines. Solid is visible to the user when selecting
line patterns.
Returns:
The element id of the solid line pattern.
Since:
2012

Autodesk.Revit.DB.LinePatternElement.GetLinePattern
Gets the LinePattern associated to this element.
Returns:
A copy of LinePattern object.
Since:
2012

Autodesk.Revit.DB.LinePatternElement
An element that represents a line pattern.
Remarks:
The LinePatternElement represents a line pattern in a project.
It enables the user to retrieve, modify or create a line pattern in a project.
Since:
2012